lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
    /*---------------------------------------------------------------------------
     * Invalidate D-Cache for Layer 2 buffer after DMA2D write.
     *
     * CRITICAL: During pre-creation of LVGL screens in StartAnimationTask(),
     * the CPU writes LVGL pixels to Layer 2 via the flush callback. These
     * writes go to D-Cache, NOT to SDRAM directly.
     *
     * When FillLayer2_OpaqueBlack() runs later (on page switch), DMA2D fills
     * Layer 2 directly in SDRAM, bypassing D-Cache. The D-Cache now contains
     * STALE data from the pre-creation phase.
     *
     * If the subsequent lv_refr_now(NULL) CPU writes trigger D-Cache evictions,
     * the stale cached data (old LVGL pixels) would be written back to SDRAM,
     * OVERWRITING the DMA2D fill. This causes visible white/colored pixels
     * appearing as a diagonal scroll on the first page switch.
     *
     * InvalidateDCache discards the stale cache lines, forcing the CPU to
     * read from SDRAM (which has the correct DMA2D fill data).
     *---------------------------------------------------------------------------
     */
    SCB_InvalidateDCache_by_Addr((uint32_t *)UI_BUF_ADDR, 800 * 480 * sizeof(uint16_t));
}

/*---------------------------------------------------------------------------
 * Pre-render static overlay elements to LTDC Layer 2 UI buffer
 * Called once at startup. Draws bottom bar icons + clean_text on UI buffer.
 * Layer 2 uses ARGB1555 format: alpha=1 for overlay, alpha=0 for transparent.
 *---------------------------------------------------------------------------
 */
static void DrawTextLineCenter(uint16_t log_y, const char *text, uint16_t color);
static void DrawNumberAtCenter(uint16_t center_x, uint16_t log_y,
                               const char *text, uint16_t color);

/*---------------------------------------------------------------------------
 * Render a single bottom-bar icon on the UI buffer with 90° CW rotation.
 *   icon:   icon descriptor (RGB565 pixel data)
 *   log_x:  logical left edge of the icon (portrait coordinate)
 *   log_y:  logical top edge of the icon (portrait coordinate)
 *   ui_buf: pointer to the UI buffer (ARGB1555)
 *
 * 90° CW rotation: logical (sx, sy) -> physical (log_y + sy, 479 - log_x - sx)
 * Pixels with value 0x0001 (transparent marker) are skipped.
 * Pixel value 0x0000 is actual black (from black-background images), NOT skipped.
 *---------------------------------------------------------------------------
 */
static void DrawIcon(const icon_desc_t *icon, uint16_t log_x, uint16_t log_y,
                     uint16_t *ui_buf)
{
    const uint8_t *src = icon->data;
    int w = icon->w;
    int h = icon->h;

    for (int sy = 0; sy < h; sy++)
    {
        for (int sx = 0; sx < w; sx++)
        {
            /* Read RGB565 (little-endian) */
            uint16_t pixel = (uint16_t)src[sy * icon->stride + sx * 2]
                           | ((uint16_t)src[sy * icon->stride + sx * 2 + 1] << 8);
            /* Skip transparent marker (0x0001) */
            if (pixel == 0x0001)
                continue;
            /* 90° CW rotation: logical (log_x + sx, log_y + sy) -> physical */
            int px = log_y + sy;
            int py = 479 - log_x - sx;
            ui_buf[py * UI_BUF_STRIDE + px] = rgb565_to_argb1555(pixel);
        }
    }
}

static void PreRenderUI(void)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;

    /*---------------------------------------------------------------------------
     * Bottom label image — placed at the bottom of the 320x480 rectangular border.
     *
     * Rect border logical coordinates: x 80..400, y 160..640.
     * Image is 320x143 (scaled to width=320), positioned at the bottom edge.
     *   log_x = 80 (left edge of the rect)
     *   log_y = 640 - 143 = 497 (bottom of rect - image height)
     *
     * The image has been pre-processed to remove the "豆包AI生成" watermark
     * at the bottom-right corner and the large number in the middle.
     *---------------------------------------------------------------------------
     */
    DrawIcon(&bottom_label, 80, 497, ui_buf);

    /*---------------------------------------------------------------------------
     * Bottom bar sensor numbers — Montserrat 32, white, centered under icons.
     *
     * Middle space: y=528 (pm25 bottom) to y=570 (ugm3 top), 42px height.
     * Font: Montserrat 32 (line_height=35, base_line=6, ascender=29, digit ~23px).
     * Vertically centered: log_y = 531 → glyph extends from y=537 to y=560.
     *
     * Horizontal centers (same as bottom bar icons):
     *   PM2.5 center x = 146, TVOC center x = 239, CO2 center x = 322
     * Numbers are centered at these positions.
     *---------------------------------------------------------------------------
     */
    DrawNumberAtCenter(146, 554, "1",   0xFFFF);
    DrawNumberAtCenter(239, 554, "30",  0xFFFF);
    DrawNumberAtCenter(332, 554, "480", 0xFFFF);

    /* Clean text: 140x116 RGB565, 90 deg CCW rotation, full image (with black bg) */
    const uint16_t *text_rgb = (const uint16_t *)_binary_clean_text_rgb_raw_start;
    for (int sy = 0; sy < OVLY_LOGICAL_H; sy++)
    {
        for (int sx = 0; sx < OVLY_LOGICAL_W; sx++)
        {
            /* 90 deg CCW: source (sx, sy) -> physical (OVLY_DST_X + sy, OVLY_DST_Y + (OVLY_LOGICAL_W-1-sx)) */
            int px = OVLY_DST_X + sy;
            int py = OVLY_DST_Y + (OVLY_LOGICAL_W - 1 - sx);
            ui_buf[py * UI_BUF_STRIDE + px] = rgb565_to_argb1555(text_rgb[sy * OVLY_LOGICAL_W + sx]);
        }
    }

    /*---------------------------------------------------------------------------
     * 320x480 blue border rectangle, 2px thick, centered on portrait display.
     *   Logical: (80, 160) to (400, 640) = 320x480, centered 480x800 portrait.
     *   After 90° CCW panel rotation to physical (800x480):
     *     Top edge    (logical y=160,161)  → physical x=160,161; y=79..399  (2px wide vertical)
     *     Bottom edge (logical y=639,640)  → physical x=639,640; y=79..399  (2px wide vertical)
     *     Left edge   (logical x=80,81)    → physical y=398,399; x=160..640 (2px thick horizontal)
     *     Right edge  (logical x=399,400)  → physical y=79,80;   x=160..640 (2px thick horizontal)
     *   Interior is transparent (ARGB1555=0x0000) → animation shows through.
     *   Drawn after bottom_bar/clean_text to be on top.
     *---------------------------------------------------------------------------
     */
    #define BLUE_BORDER_ARGB1555  0x801F   /* ARGB1555: A=1, R=0, G=0, B=31 */

    /* Top edge: physical vertical lines at x=160,161, y=79..399 */
    for (int y = 79; y <= 399; y++)
    {
        ui_buf[y * UI_BUF_STRIDE + 160] = BLUE_BORDER_ARGB1555;
        ui_buf[y * UI_BUF_STRIDE + 161] = BLUE_BORDER_ARGB1555;
    }
    /* Bottom edge: physical vertical lines at x=639,640, y=79..399 */
    for (int y = 79; y <= 399; y++)
    {
        ui_buf[y * UI_BUF_STRIDE + 639] = BLUE_BORDER_ARGB1555;
        ui_buf[y * UI_BUF_STRIDE + 640] = BLUE_BORDER_ARGB1555;
    }
    /* Left edge: physical horizontal lines at y=398,399, x=160..640 */
    for (int x = 160; x <= 640; x++)
    {
        ui_buf[398 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
        ui_buf[399 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
    }
    /* Right edge: physical horizontal lines at y=79,80, x=160..640 */
    for (int x = 160; x <= 640; x++)
    {
        ui_buf[79 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
        ui_buf[80 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
    }

