lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
    /*---------------------------------------------------------------------------
     * Three lines centered above the 320px rectangle.
     *   Logical y=70  → "animation demo"
     *   Logical y=102 → "STM32H743IIT6"
     *   Logical y=134 → "20fps"
     *   White text (0xFFFF), transparent background.
     *---------------------------------------------------------------------------
     */
    DrawTextLineCenter(70,  "animation demo",   0xFFFF);
    DrawTextLineCenter(102, "STM32H743IIT6",    0xFFFF);
    DrawTextLineCenter(134, "20fps",            0xFFFF);

    /*---------------------------------------------------------------------------
     * Clean D-Cache for the Layer 2 UI buffer so LTDC reads the freshly
     * rendered data from SDRAM. Without this, the CPU's write-back cache
     * holds the data and LTDC (reading from SDRAM via AHB) sees stale data.
     *---------------------------------------------------------------------------
     */
    SCB_CleanDCache_by_Addr((uint32_t *)UI_BUF_ADDR, 800 * 480 * sizeof(uint16_t));
}

/* Font metrics for frame number (8x16 bitmap, 2x scaled) */
#define FONT_SCALE   2
#define CHAR_W       (8 * FONT_SCALE)   /* 16 px */

/* Use LVGL Montserrat 24 font — anti-aliased, much better than 8x16 bitmap */
#include "src/font/lv_font.h"
LV_FONT_DECLARE(lv_font_montserrat_24);
#define LV_FONT (&lv_font_montserrat_24)

/* Roboto Bold 32 for bottom bar sensor numbers (closer to UI design spec) */
#include "fonts.h"

#include "lv_demo.h"

/* LVGL screen references for page switching (create once, load on switch) */
/* LVGL screen references for page switching (create once, load on switch) */
static lv_obj_t *brightness_screen = NULL;
static lv_obj_t *filter_screen = NULL;
static lv_obj_t *metrics1_screen = NULL;
static lv_obj_t *metrics2_screen = NULL;

#define FN_X         4
#define FN_Y         4

/*---------------------------------------------------------------------------
 * Draw a single text line horizontally centered above the 320px rectangle
 * Uses LVGL Montserrat 14 font (anti-aliased).
 *   log_y: logical y position (portrait coordinate)
 *   color: ARGB1555 color (must have A=1 bit set, e.g. 0xFFFF for white)
 *   Text is centered horizontally in the 320px rectangle (logical x=80..400).
 *   Each pixel is rotated from logical to physical via the 90° CCW mapping.
 *---------------------------------------------------------------------------
 */
static void DrawTextLineCenter(uint16_t log_y, const char *text, uint16_t color)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;

    /* First pass: calculate total width (sum of adv_w for each char) */
    int len = strlen(text);
    int total_w = 0;
    for (int i = 0; i < len; i++)
    {
        lv_font_glyph_dsc_t dsc;
        if (lv_font_get_glyph_dsc(LV_FONT, &dsc, (uint32_t)(uint8_t)text[i], 0))
            total_w += dsc.adv_w;
        else
            total_w += LV_FONT->line_height / 2; /* fallback */
    }

    /* Center horizontally in the 320px logical rectangle (x=80 to 400) */
    int log_x = 80 + ((400 - 80) - total_w) / 2;
    int cursor_x = log_x;

    /* Second pass: render each glyph */
    for (int i = 0; i < len; i++)
    {
        uint32_t letter = (uint32_t)(uint8_t)text[i];
        lv_font_glyph_dsc_t dsc;
        if (!lv_font_get_glyph_dsc(LV_FONT, &dsc, letter, 0))
        {
            cursor_x += LV_FONT->line_height / 2;
            continue;
        }

        const uint8_t *bmp = lv_font_get_glyph_bitmap(LV_FONT, letter);
        if (!bmp) continue;
        int bpp = dsc.bpp;

        /* Glyph top in logical coordinates.
         * LVGL formula: gpos_y = baseline - box_h - ofs_y
         *   baseline = log_y + (line_height - base_line)
         */
        int gpos_y = log_y + (LV_FONT->line_height - LV_FONT->base_line) - dsc.box_h - dsc.ofs_y;

        /* Render glyph bitmap (row-major: for each row, then each column).
         * LVGL stores bitmaps in row-major order with bpp bits per pixel.
         * For bpp=4: each byte = 2 pixels (high nibble first, low nibble second).
         */
        for (int row = 0; row < dsc.box_h; row++)
        {
            for (int col = 0; col < dsc.box_w; col++)
            {
                /* Extract pixel value from row-major bitmap */
                int pixel_idx = row * dsc.box_w + col;
                uint8_t pixel_val;

                if (bpp == 1)
                    pixel_val = (bmp[pixel_idx / 8] >> (7 - (pixel_idx % 8))) & 1;
                else if (bpp == 2)
                    pixel_val = (bmp[pixel_idx / 4] >> (6 - 2 * (pixel_idx % 4))) & 3;
                else if (bpp == 4)
                    pixel_val = (bmp[pixel_idx / 2] >> (4 * (1 - (pixel_idx % 2)))) & 0x0F;
                else /* bpp == 8 */
                    pixel_val = bmp[pixel_idx];

                if (pixel_val == 0) continue; /* transparent */

                /* Logical pixel position:
                 *   lx = cursor_x + ofs_x + col
                 *   ly = gpos_y + row
                 */
                int lx = cursor_x + dsc.ofs_x + col;
                int ly = gpos_y + row;

                /* Convert to physical: px = ly, py = 479 - lx */
                int px = ly;
                int py = 479 - lx;

                if (px >= 0 && px < UI_BUF_STRIDE && py >= 0 && py < LCD_HEIGHT)
                {
                    /* For anti-aliased (bpp>1), dim the color for edge pixels */
                    if (bpp > 1)
                    {
                        int max_val = (1 << bpp) - 1;
                        int r = ((color >> 10) & 0x1F) * pixel_val / max_val;
                        int g = ((color >> 5) & 0x1F) * pixel_val / max_val;
                        int b = (color & 0x1F) * pixel_val / max_val;
                        ui_buf[py * UI_BUF_STRIDE + px] = 0x8000 | (r << 10) | (g << 5) | b;
                    }
                    else
                    {
                        ui_buf[py * UI_BUF_STRIDE + px] = color;
                    }
                }
            }
        }

