lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
        cursor_x += dsc.adv_w;
    }
}

/*---------------------------------------------------------------------------
 * Draw a number string centered at a specific logical x position.
 * Uses Montserrat 32 font (anti-aliased) for the bottom bar sensor values.
 *   center_x: logical x of the number's center
 *   log_y:    logical y position (top of the text line)
 *   color:    ARGB1555 color (must have A=1 bit set, e.g. 0xFFFF for white)
 *---------------------------------------------------------------------------
 */
static void DrawNumberAtCenter(uint16_t center_x, uint16_t log_y,
                               const char *text, uint16_t color)
{
    const lv_font_t *font = &inter_bold_42;
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;

    /* First pass: calculate total width */
    int len = strlen(text);
    int total_w = 0;
    for (int i = 0; i < len; i++)
    {
        lv_font_glyph_dsc_t dsc;
        if (lv_font_get_glyph_dsc(font, &dsc, (uint32_t)(uint8_t)text[i], 0))
            total_w += dsc.adv_w;
        else
            total_w += font->line_height / 2;
    }

    /* Center at the given position */
    int cursor_x = (int)center_x - total_w / 2;

    /* Second pass: render each glyph */
    for (int i = 0; i < len; i++)
    {
        uint32_t letter = (uint32_t)(uint8_t)text[i];
        lv_font_glyph_dsc_t dsc;
        if (!lv_font_get_glyph_dsc(font, &dsc, letter, 0))
        {
            cursor_x += font->line_height / 2;
            continue;
        }

        const uint8_t *bmp = lv_font_get_glyph_bitmap(font, letter);
        if (!bmp) continue;
        int bpp = dsc.bpp;

        int gpos_y = log_y + (font->line_height - font->base_line) - dsc.box_h - dsc.ofs_y;

        for (int row = 0; row < dsc.box_h; row++)
        {
            for (int col = 0; col < dsc.box_w; col++)
            {
                int pixel_idx = row * dsc.box_w + col;
                uint8_t pixel_val;

                if (bpp == 1)
                    pixel_val = (bmp[pixel_idx / 8] >> (7 - (pixel_idx % 8))) & 1;
                else if (bpp == 2)
                    pixel_val = (bmp[pixel_idx / 4] >> (6 - 2 * (pixel_idx % 4))) & 3;
                else if (bpp == 4)
                    pixel_val = (bmp[pixel_idx / 2] >> (4 * (1 - (pixel_idx % 2)))) & 0x0F;
                else
                    pixel_val = bmp[pixel_idx];

                if (pixel_val == 0) continue;

                int lx = cursor_x + dsc.ofs_x + col;
                int ly = gpos_y + row;

                /* 90° CCW rotation: physical (px, py) = (ly, 479 - lx) */
                int px = ly;
                int py = 479 - lx;

                if (px >= 0 && px < UI_BUF_STRIDE && py >= 0 && py < LCD_HEIGHT)
                {
                    if (bpp > 1)
                    {
                        int max_val = (1 << bpp) - 1;
                        int r = ((color >> 10) & 0x1F) * pixel_val / max_val;
                        int g = ((color >> 5) & 0x1F) * pixel_val / max_val;
                        int b = (color & 0x1F) * pixel_val / max_val;
                        ui_buf[py * UI_BUF_STRIDE + px] = 0x8000 | (r << 10) | (g << 5) | b;
                    }
                    else
                    {
                        ui_buf[py * UI_BUF_STRIDE + px] = color;
                    }
                }
            }
        }

        cursor_x += dsc.adv_w;
    }
}



/*---------------------------------------------------------------------------
 * Switch back to animation page: restore UI overlays on Layer 2
 *---------------------------------------------------------------------------
 */
static void SwitchToAnimationPage(void)
{
    /* STEP 1: Fill both animation framebuffers to black FIRST.
     * This ensures the background is already black before any UI elements
     * appear on Layer 2. Doing this after PreRenderUI causes a visible
     * flicker: white background + UI elements → background turns black.
     */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    /* Clear back buffer via DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_BACK, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_BACK, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Clear front buffer via DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_FRONT, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_FRONT, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Ensure LTDC uses the front buffer and update tracking variable */
    LTDC_Layer1->CFBAR = FB_FRONT;
    fb_active = FB_FRONT;

    /* STEP 2: Now clear Layer 2 to transparent and re-render UI overlays.
     * The background is already black, so UI elements will appear on a
     * dark background with no flicker.
     */
    ClearLayer2_Transparent();
    PreRenderUI();

    printf("PAGE: switched to Animation (buffers cleared)\r\n");
    current_page = PAGE_ANIMATION;
}

/*---------------------------------------------------------------------------
 * Switch to Brightness page
 *---------------------------------------------------------------------------
 */
static void SwitchToBrightnessPage(void)
{
    /*---------------------------------------------------------------------------
     * Pre-fill Layer 2 with opaque black before
     * loading the LVGL screen, preventing the band-by-band background paint
     * flash. All three pages use black backgrounds, so no white flash.
     *---------------------------------------------------------------------------
     */
    FillLayer2_OpaqueBlack();

    /* Fill both animation framebuffers (Layer 1) with black. Since Layer 2 is
     * already filled with opaque black, the content of Layer 1 is completely
     * hidden. We fill Layer 1 to black for consistency and to avoid stale
     * animation pixels in case of future layer reconfiguration.
     */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    uint32_t inactive_fb = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;
    uint32_t other_fb = (inactive_fb == FB_FRONT) ? FB_BACK : FB_FRONT;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, inactive_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)inactive_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

