lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
    LTDC_Layer1->CFBAR = inactive_fb;
    fb_active = inactive_fb;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, other_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)other_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Set up Brightness LVGL screen (create once, load on switch)
     * Same approach as Animation page: no Layer 2 disable/enable,
     * no lv_refr_now(NULL), let the LVGL task handler render naturally.
     */
    if (lv_is_initialized()) {
        if (brightness_screen == NULL) {
            brightness_screen = lv_obj_create(NULL);
            lvgl_brightness_create(brightness_screen);
        }
        lv_scr_load(brightness_screen);
        /* Critical invalidation: without this, lv_scr_load() may return early
         * if the screen is already active, and the LVGL task handler won't
         * re-render.
         */
        lv_obj_invalidate(brightness_screen);
    }

    printf("PAGE: switched to Brightness\r\n");
    current_page = PAGE_BRIGHTNESS;
}

/*---------------------------------------------------------------------------
 * Switch to Filter page
 *--------------------------------------------------------------------------*/
static void SwitchToFilterPage(void)
{
    FillLayer2_OpaqueBlack();

    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    uint32_t inactive_fb = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;
    uint32_t other_fb = (inactive_fb == FB_FRONT) ? FB_BACK : FB_FRONT;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, inactive_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)inactive_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    LTDC_Layer1->CFBAR = inactive_fb;
    fb_active = inactive_fb;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, other_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)other_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    if (lv_is_initialized()) {
        if (filter_screen == NULL) {
            filter_screen = lv_obj_create(NULL);
            lvgl_filter_create(filter_screen);
        }
        lv_scr_load(filter_screen);
        lv_obj_invalidate(filter_screen);
        /* Force immediate LVGL refresh and sync D-Cache so DMA2D/LTDC see pixels */
        lv_refr_now(NULL);
        SCB_CleanDCache_by_Addr((uint32_t *)UI_BUF_ADDR, 800 * 480 * sizeof(uint16_t));
    }

    printf("PAGE: switched to Filter\r\n");
    current_page = PAGE_FILTER;
}

/*---------------------------------------------------------------------------
 * Switch to Metrics page (Main Screen secondary)
 *--------------------------------------------------------------------------*/
static void SwitchToMetrics1Page(void)
{
    FillLayer2_OpaqueBlack();

    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    uint32_t inactive_fb = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;
    uint32_t other_fb = (inactive_fb == FB_FRONT) ? FB_BACK : FB_FRONT;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, inactive_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)inactive_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    LTDC_Layer1->CFBAR = inactive_fb;
    fb_active = inactive_fb;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, other_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)other_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    if (lv_is_initialized()) {
        if (metrics1_screen == NULL) {
            metrics1_screen = lv_obj_create(NULL);
            lvgl_metrics1_create(metrics1_screen);
        }
        lv_scr_load(metrics1_screen);
        lv_obj_invalidate(metrics1_screen);
        lv_refr_now(NULL);
        SCB_CleanDCache_by_Addr((uint32_t *)UI_BUF_ADDR, 800 * 480 * sizeof(uint16_t));
    }

    printf("PAGE: switched to Metrics1\r\n");
    current_page = PAGE_METRICS1;
}

/*---------------------------------------------------------------------------
 * Switch to Metrics2 page
 *--------------------------------------------------------------------------*/
static void SwitchToMetrics2Page(void)
{
    FillLayer2_OpaqueBlack();

    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    uint32_t inactive_fb = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;
    uint32_t other_fb = (inactive_fb == FB_FRONT) ? FB_BACK : FB_FRONT;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, inactive_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)inactive_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    LTDC_Layer1->CFBAR = inactive_fb;
    fb_active = inactive_fb;

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, BG_COLOR_RGB565, other_fb, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)other_fb, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    if (lv_is_initialized()) {
        if (metrics2_screen == NULL) {
            metrics2_screen = lv_obj_create(NULL);
            lvgl_metrics2_create(metrics2_screen);
        }
        lv_scr_load(metrics2_screen);
        lv_obj_invalidate(metrics2_screen);
        lv_refr_now(NULL);
        SCB_CleanDCache_by_Addr((uint32_t *)UI_BUF_ADDR, 800 * 480 * sizeof(uint16_t));
    }

    printf("PAGE: switched to Metrics2\r\n");
    current_page = PAGE_METRICS2;
}

