lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
/*---------------------------------------------------------------------------
 * Draw frame number on LTDC Layer 2 UI buffer (ARGB1555)
 * Called every frame. White text on transparent background.
 * Uses UI_BUF_STRIDE (800) instead of LCD_FB_STRIDE (1600).
 *---------------------------------------------------------------------------
 */
static void DrawFrameNumberUI(int num)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;
    char buf[8];
    int len = sprintf(buf, "%d", num);
    int x, y, row, col, sx, sy;

    for (int i = 0; i < len; i++)
    {
        int idx = buf[i] - '0';
        if (idx < 0 || idx > 9) continue;

        for (row = 0; row < 16; row++)
        {
            uint8_t line = digit_font[idx][row];
            for (col = 0; col < 8; col++)
            {
                /* ARGB1555: 0xFFFF = white opaque, 0x0000 = transparent */
                uint16_t pixel = (line & (0x80 >> col)) ? 0xFFFF : 0x0000;
                for (sy = 0; sy < FONT_SCALE; sy++)
                {
                    for (sx = 0; sx < FONT_SCALE; sx++)
                    {
                        x = FN_X + i * CHAR_W + col * FONT_SCALE + sx;
                        y = FN_Y + row * FONT_SCALE + sy;
                        if (x < 800 && y < 480)
                            ui_buf[y * UI_BUF_STRIDE + x] = pixel;
                    }
                }
            }
        }
    }
}

/*---------------------------------------------------------------------------
 * Timer callback (50ms = 20fps)
 *---------------------------------------------------------------------------
 */
void AnimTimerCallback(void *argument)
{
    (void)argument;
    if (num_frames > 0)
    {
        frame_index = (frame_index + 1) % num_frames;
    }
    osSemaphoreRelease(anim_sem_id);
}

/*---------------------------------------------------------------------------
 * Animation task
 *---------------------------------------------------------------------------
 */
void StartAnimationTask(void *argument)
{
    (void)argument;

    /* Give defaultTask time to finish init (LCD, USART, QSPI, etc.) */
    osDelay(500);

    /* Create binary semaphore: max count = 1, initial count = 0 */
    anim_sem_id = osSemaphoreNew(1, 0, NULL);

    /* Clear both framebuffers to black */
    LCD_Clear(LCD_COLOR_BLACK);

    /* Clear back buffer using DMA2D R2M */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_BACK, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 10);
    /* Clean D-cache for the cleared back buffer */
    SCB_CleanDCache_by_Addr((uint32_t *)FB_BACK, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Pre-render static overlays (bottom_bar, clean_text, rectangle, title text)
     * to LTDC Layer 2 UI buffer immediately after clearing the framebuffers.
     * This ensures UI elements are visible from the very first frame, before
     * any potentially slow QSPI initialization.
     */
    PreRenderUI();

    /* Write header + frame table to QSPI Flash (first boot only, uses direct QSPI commands) */
    if (QSPI_Video_WriteToFlash() != HAL_OK)
    {
        printf("ANIM: QSPI header write failed\r\n");
        osDelay(1000);
        NVIC_SystemReset();
    }

    /* Check if frame data is present (direct QSPI read, no mmap needed) */
    if (!QSPI_Video_IsDataProgrammed())
    {
        printf("ANIM: Frame data not found, entering programming mode...\r\n");
        if (QSPI_Video_ProgramFrameData() != HAL_OK)
        {
            printf("ANIM: Frame data programming failed\r\n");
            osDelay(1000);
            NVIC_SystemReset();
        }
        printf("ANIM: Frame data programmed, resetting...\r\n");
        osDelay(500);
        NVIC_SystemReset();
    }

    /* Enable QSPI memory-mapped mode for DMA2D direct access */
    if (QSPI_EnableMemoryMappedMode() != HAL_OK)
    {
        printf("ANIM: QSPI mmap failed\r\n");
        osDelay(1000);
        NVIC_SystemReset();
    }

    /* Get number of frames from QSPI Flash (now mmap is active) */
    num_frames = QSPI_Video_GetFrameCount();

    /* Enable DWT cycle counter for profiling */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    printf("Animation Phase 6: Raw RGB565 QSPI, %lu frames, %dx%d at %dfps\r\n",
           num_frames, ANIM_FRAME_WIDTH, ANIM_FRAME_HEIGHT, ANIM_FPS);

    /*---------------------------------------------------------------------------
     * Pre-create LVGL screens during initialization.
     * This ensures the slow initial widget creation and LVGL style setup
     * happens during power-up, NOT during the user's first page switch.
     * Without this, the first switch triggers a full LVGL render + flush
     * that is visible as a diagonally scrolling white flash.
     *---------------------------------------------------------------------------
     */
    if (lv_is_initialized()) {
        if (brightness_screen == NULL) {
            brightness_screen = lv_obj_create(NULL);
            lvgl_brightness_create(brightness_screen);
        }
        if (filter_screen == NULL) {
            filter_screen = lv_obj_create(NULL);
            lvgl_filter_create(filter_screen);
        }
        if (metrics1_screen == NULL) {
            metrics1_screen = lv_obj_create(NULL);
            lvgl_metrics1_create(metrics1_screen);
        }
        if (metrics2_screen == NULL) {
            metrics2_screen = lv_obj_create(NULL);
            lvgl_metrics2_create(metrics2_screen);
        }
    }

    for (;;)
    {
        /* Wait for 50ms timer to signal next frame */
        osSemaphoreAcquire(anim_sem_id, osWaitForever);

        /*--------------------------------------------------------------------
         * Poll KEY_UP (Screen Button) and KEY_DOWN (Option Button)
         * KEY_UP  = PA0 -> active HIGH
         * KEY_DOWN= PH2 -> active LOW
         * - KEY_UP cycles main pages: Animation -> Filter -> Brightness
         * - KEY_DOWN when on Animation switches to Metrics (secondary page)
         *   KEY_DOWN on Brightness is handled by LVGL event handler.
         *--------------------------------------------------------------------
         */
        {
            uint8_t key_up = (HAL_GPIO_ReadPin(KEY_UP_GPIO_Port, KEY_UP_Pin) == GPIO_PIN_SET) ? 1 : 0;
            uint8_t key_down = (HAL_GPIO_ReadPin(KEY_DOWN_GPIO_Port, KEY_DOWN_Pin) == GPIO_PIN_RESET) ? 1 : 0;

            if (key_up != prev_key_up || key_down != prev_key_down) {
                printf("DEBUG_KEYS: key_up=%d key_down=%d\r\n", key_up, key_down);
            }

            /* Screen Button: KEY_DOWN press (active low -> key_down==1) -> advance among main pages */
            if (prev_key_down == 0 && key_down == 1)
            {
                PageState_t base = current_page;
                if (base == PAGE_METRICS1 || base == PAGE_METRICS2) base = PAGE_ANIMATION; /* treat metrics as main=animation */

                if (base == PAGE_ANIMATION)       SwitchToFilterPage();
                else if (base == PAGE_FILTER)     SwitchToBrightnessPage();
                else if (base == PAGE_BRIGHTNESS) SwitchToAnimationPage();
            }

            /* Option Button: KEY_UP press (rising edge) when on Animation -> Metrics
             * Other pages should handle KEY_UP via LVGL event handlers. */
            if (prev_key_up == 0 && key_up == 1)
            {
                if (current_page == PAGE_ANIMATION)
                {
                    /* Animation -> Metrics1 */
                    SwitchToMetrics1Page();
                }
                else if (current_page == PAGE_METRICS1)
                {
                    /* Metrics1 -> Metrics2 */
                    SwitchToMetrics2Page();
                }
                else if (current_page == PAGE_METRICS2)
                {
                    /* Metrics2 -> Animation */
                    SwitchToAnimationPage();
                }
                /* else: let LVGL handle KEY_UP events on pages that use it */
            }

            prev_key_up = key_up;
            prev_key_down = key_down;
        }

        /* Skip rendering when not on the animation page (keep polling buttons) */
        if (current_page != PAGE_ANIMATION)
        {
            continue;
        }

        uint32_t t0 = DWT->CYCCNT;

        /* Get QSPI memory-mapped address for this frame */
        uint32_t src_addr = QSPI_Video_GetFrameAddr(frame_index);
        if (src_addr == 0)
        {
            printf("ANIM: Invalid frame address for frame %d\r\n", frame_index);
            continue;
        }

        uint32_t t1 = DWT->CYCCNT;

        /* Determine the inactive framebuffer */
        uint32_t fb_dst = (fb_active == FB_FRONT) ? FB_BACK : FB_FRONT;

        /* CPU rotate + copy animation frame (CopyFrame adds ANIM_DST_X/Y internally) */
        CopyFrame((const uint16_t *)src_addr, (uint16_t *)fb_dst);
        /* Clean D-cache for the destination framebuffer so LTDC reads updated data */
        SCB_CleanDCache_by_Addr((uint32_t *)fb_dst, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));
        uint32_t t2 = DWT->CYCCNT;

        /* Draw frame number on LTDC Layer 2 UI buffer (ARGB1555, transparent bg) */
        DrawFrameNumberUI(frame_index);

        /* Swap LTDC Layer 1 (animation) to the inactive buffer */
        SwapFramebuffer(fb_dst);
        uint32_t t3 = DWT->CYCCNT;

        /* Print timing every 20 frames (HCLK=200MHz → 1 tick = 5ns) */
        if ((frame_index % 20) == 0)
        {
            printf("  T:%d addr=%luus CPUrot=%luus swap=%luus\r\n",
                   frame_index,
                   (t1 - t0) / 200,
                   (t2 - t1) / 200,
                   (t3 - t2) / 200);
        }
    }
}